-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: 3.38.99.110    Database: coffee_station
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `order_id` bigint NOT NULL AUTO_INCREMENT,
  `date` datetime NOT NULL,
  `request` varchar(30) DEFAULT NULL,
  `status` varchar(255) NOT NULL,
  `total_price` int NOT NULL,
  `customer_id` bigint NOT NULL,
  `shop_id` bigint NOT NULL,
  PRIMARY KEY (`order_id`),
  KEY `FK624gtjin3po807j3vix093tlf` (`customer_id`),
  KEY `FKqn03kko0738sehaal2gr2uxl6` (`shop_id`),
  CONSTRAINT `FK624gtjin3po807j3vix093tlf` FOREIGN KEY (`customer_id`) REFERENCES `customer` (`customer_id`),
  CONSTRAINT `FKqn03kko0738sehaal2gr2uxl6` FOREIGN KEY (`shop_id`) REFERENCES `shop` (`shop_id`)
) ENGINE=InnoDB AUTO_INCREMENT=261 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (1,'2021-11-08 12:39:59','얼음 많이요!!','ORDERED',16500,1,1),(2,'2021-11-08 12:59:55','얼음 많이요!!','ORDERED',4000,2,1),(3,'2021-11-07 13:33:33','얼음 많이요!!','COMPLETED',4500,3,2),(4,'2021-11-08 13:44:33','얼음 많이요!!','ORDERED',4000,4,2),(5,'2021-11-09 13:45:33','얼음z 많이요z!!','COMPLETED',8500,4,3),(6,'2021-11-08 13:55:33','fgdsfgsdfg','PAID',4500,5,3),(7,'2021-11-11 08:55:55','덜 달게 해주세요.','PAID',15500,1,1),(8,'2021-11-11 09:00:06','덜 달게 해주세요.','ORDERED',15500,1,1),(59,'2021-11-13 06:29:32','12121212','ORDERED',12100,11,3),(60,'2021-11-13 06:48:49','','ORDERED',12100,11,3),(61,'2021-11-13 08:19:41','','ORDERED',12100,11,3),(62,'2021-11-13 08:22:35','wnansdmf','ORDERED',12100,11,3),(63,'2021-11-13 08:23:43','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(64,'2021-11-13 08:28:08','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(65,'2021-11-13 08:28:28','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(66,'2021-11-13 08:32:05','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(67,'2021-11-14 05:26:46','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(68,'2021-11-14 05:34:47','quickly','ORDERED',12100,11,3),(69,'2021-11-14 05:36:40','quickly','ORDERED',12100,11,3),(70,'2021-11-14 05:38:18','quickly','ORDERED',12100,11,3),(71,'2021-11-14 05:39:35','quickly','ORDERED',12100,11,3),(72,'2021-11-14 05:49:09','quickly','ORDERED',12100,11,3),(73,'2021-11-14 05:49:46','quickly','ORDERED',12100,11,3),(74,'2021-11-14 05:51:10','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(75,'2021-11-14 06:09:08','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(76,'2021-11-14 06:10:01','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(77,'2021-11-14 06:15:44','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(78,'2021-11-14 07:02:56','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(79,'2021-11-14 07:09:14','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(80,'2021-11-14 07:12:18','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(81,'2021-11-14 07:13:23','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(82,'2021-11-14 07:16:29','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(83,'2021-11-14 07:17:05','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(84,'2021-11-14 07:19:40','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(85,'2021-11-14 07:19:56','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(86,'2021-11-14 07:20:42','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(87,'2021-11-14 07:24:55','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(88,'2021-11-14 08:12:39','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(89,'2021-11-14 08:38:25','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(90,'2021-11-14 08:39:16','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(91,'2021-11-14 08:45:24','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(92,'2021-11-14 08:45:44','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(93,'2021-11-14 08:49:03','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(94,'2021-11-14 08:49:56','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(95,'2021-11-14 11:13:03','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(96,'2021-11-14 11:26:15','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(97,'2021-11-14 11:35:00','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(98,'2021-11-14 11:38:52','주문 요청 사항을 입력해주세요a','ORDERED',12100,11,3),(99,'2021-11-14 11:39:33','주문 요청 사항을 입력해주세요a','ORDERED',12100,11,3),(100,'2021-11-14 11:40:24','hihi','ORDERED',12100,11,3),(101,'2021-11-14 13:45:12','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(102,'2021-11-14 13:47:38','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(103,'2021-11-14 13:48:03','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(104,'2021-11-14 13:48:08','주문 요청 사항을 입력해주세요','ORDERED',12100,11,3),(105,'2021-11-15 08:50:24','주문 요청 사항을 입력해주세요','ORDERED',10000,3,3),(106,'2021-11-15 09:22:55','주문 요청 사항을 입력해주세요','ORDERED',20000,3,3),(107,'2021-11-15 16:24:51','주문 요청 사항을 입력해주세요','COMPLETED',4000,3,2),(108,'2021-11-15 16:25:47','주문 요청 사항을 입력해주세요','PAID',18000,3,1),(109,'2021-11-16 02:05:29','주문 요청 사항을 입력해주세요','ORDERED',16500,11,3),(110,'2021-11-16 02:12:48','주문 요청 사항을 입력해주세요212121','ORDERED',16500,11,3),(111,'2021-11-16 02:33:54','주문 요청 사항을 입력해주세요131313','PAID',8000,11,1),(112,'2021-11-16 02:40:19','주문 요청 사항을 입력해주세요','PAID',8000,11,1),(113,'2021-11-16 02:47:03','주문 요청 사항을 입력해주세요','PAID',8000,11,1),(114,'2021-11-16 02:52:04','주문 요청 사항을 입력해주세요4444','ORDERED',8000,11,1),(115,'2021-11-16 02:54:14','주문 요청 사항을 입력해주세요','PAID',8000,11,1),(116,'2021-11-16 07:47:53','주문 요청 사항을 입력해주세요','PREPARING',19500,3,1),(117,'2021-11-16 07:49:09','주문 요청 사항을 입력해주세요','ORDERED',19500,3,1),(118,'2021-11-16 07:50:43','주문 요청 사항을 입력해주세요','ORDERED',19500,3,1),(119,'2021-11-16 07:51:04','주문 요청 사항을 입력해주세요','ORDERED',45000,3,1),(120,'2021-11-16 07:51:56','As Fast as you can','PREPARING',45000,3,1),(121,'2021-11-16 07:52:04','주문 요청 사항을 입력해주세요1212','PAID',4500,11,1),(122,'2021-11-16 09:52:26','주문 요청 사항을 입력해주세요','PAID',15000,3,3),(123,'2021-11-16 09:54:55','주문 요청 사항을 입력해주세요','ORDERED',8000,3,2),(124,'2021-11-16 09:55:11','주문 요청 사항을 입력해주세요','PAID',8000,3,2),(125,'2021-11-16 12:51:08','주문 요청 사항을 입력해주세요','PAID',32500,3,2),(126,'2021-11-16 16:40:36','주문 요청 사항을 입력해주세요','PAID',13500,11,2),(127,'2021-11-16 16:45:34','주문 요청 사항을 입력해주세요','PAID',13500,11,2),(128,'2021-11-16 17:40:01','주문 요청 사항을 입력해주세요','PREPARING',4500,3,1),(129,'2021-11-17 02:52:54','주문1212121','ORDERED',13500,11,2),(130,'2021-11-17 02:53:20','주문 요청 사항을 입력해주세요','ORDERED',13500,11,2),(131,'2021-11-17 02:55:19','1155','PAID',13500,11,2),(132,'2021-11-17 04:06:21','주문 요청 사항을 입력해주세요','PAID',13500,11,2),(133,'2021-11-17 04:07:05','주문 요청 사항을 입력해주세요','PAID',13500,11,2),(134,'2021-11-17 05:08:00','주문 요청 사항을 입력해주세요','PAID',21000,3,3),(135,'2021-11-17 05:08:57','주문 요청 사항을 입력해주세요','PREPARING',33000,3,1),(136,'2021-11-17 05:09:38','1232123','PREPARING',20000,4,1),(137,'2021-11-17 05:10:00','주문 요청 사항을 입력해주세요','ORDERED',12000,3,1),(138,'2021-11-17 05:10:27','주문 요청 사항을 입력해주세요','PREPARING',12000,3,1),(139,'2021-11-17 05:11:11','주문 요청 사항을 입력해주세요','PREPARING',16000,3,1),(140,'2021-11-17 05:12:50','주문 요청 사항을 입력해주세요','ORDERED',34000,4,1),(141,'2021-11-17 05:14:20','fast!!!!!!!!!!!!!!!','ORDERED',28000,3,1),(142,'2021-11-17 05:14:43','주문 요청 사항을 입력해주세요','ORDERED',34000,4,1),(143,'2021-11-17 05:15:11','I love ice!','ORDERED',4000,3,1),(144,'2021-11-17 05:15:31','I love ice!','PREPARING',4000,3,1),(145,'2021-11-17 05:15:36','주문 요청 사항을 입력해주세요','PREPARING',60000,4,1),(146,'2021-11-17 05:44:03','주문 요청 사항을 입력해주세요','ORDERED',10000,3,1),(147,'2021-11-17 05:44:49','zzzzzzzzzzz','ORDERED',6000,3,1),(148,'2021-11-17 05:45:12','zzzzzzzzzzz','PAID',6000,3,1),(149,'2021-11-17 05:46:15','주문 요청 사항을 입력해주세요','COMPLETED',4000,3,1),(150,'2021-11-17 05:49:34','0249','COMPLETED',4500,11,1),(151,'2021-11-17 05:50:15','0250','COMPLETED',4500,11,1),(152,'2021-11-17 05:51:23','0251','PAID',15000,11,2),(153,'2021-11-17 05:52:26','주문 요청 사항을 입력해','PAID',15000,11,2),(154,'2021-11-17 06:01:12','주문 요청 사항을 입력해주세요','PAID',45000,4,1),(155,'2021-11-17 06:19:28','주문 요청 사항을 입력해주세요','ORDERED',20500,3,2),(206,'2021-11-17 09:38:11','주문 요청 사항을 입력해주세요','ORDERED',4500,11,1),(207,'2021-11-17 09:38:38','0638','ORDERED',4500,11,1),(208,'2021-11-17 09:40:22','주문 요청 사항을 입력해주세요','PAID',4500,11,1),(209,'2021-11-17 09:41:00','0638','PAID',4500,11,1),(212,'2021-11-17 12:33:18','주문 요청 사항을 입력해주세요','ORDERED',18000,4,1),(213,'2021-11-17 14:27:20','','ORDERED',22500,4,1),(214,'2021-11-17 14:27:20','','ORDERED',22500,4,1),(215,'2021-11-17 14:34:56','주문 요청 사항을 입력해주세요','PAID',12000,11,1),(216,'2021-11-17 14:35:14','','ORDERED',22500,4,1),(246,'2021-11-18 07:18:42','','PREPARING',8500,2,1),(247,'2021-11-18 07:27:53','','PAID',26500,2,1),(248,'2021-11-18 07:28:11','','REJECT',12000,2,1),(249,'2021-11-18 11:37:03','please~~~~~~hurry','COMPLETED',10500,3,3),(250,'2021-11-18 13:14:57','','PREPARING',9000,1,1),(253,'2021-11-18 16:13:58','Qt','ORDERED',13500,11,1),(254,'2021-11-18 16:15:00','Er','PAID',4500,11,2),(255,'2021-11-18 16:16:26','Ss','PREPARING',13500,11,2),(257,'2021-11-18 18:10:51','','PAID',15000,4,1),(258,'2021-11-18 19:32:22','Have a Nice Day~','ORDERED',10500,3,2),(259,'2021-11-18 19:32:40','Have a Nice Day~','ORDERED',10500,3,2),(260,'2021-11-18 19:33:13','Have a Nice day~~','COMPLETED',10500,3,2);
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-19  4:56:45
